tutorials/rigidBodyAndBeam/rigidBodyAndBeam_loop/0/beam/CQW
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceTensorField;
    location    "2";
    object      CQW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

internalField   nonuniform List<tensor> 
59
(
(150.796 -6.13852e-20 -8.39712e-15 -6.13852e-20 150.796 2.48533e-24 -8.397e-15 2.48534e-24 150.796)
(150.796 -5.65067e-20 -9.91145e-15 -5.65067e-20 150.796 7.36763e-24 -9.91077e-15 7.3676e-24 150.796)
(150.796 -5.59296e-20 -7.07376e-15 -5.59296e-20 150.796 -2.76923e-24 -7.07399e-15 -2.76919e-24 150.796)
(150.796 -6.40223e-20 -8.61713e-15 -6.40223e-20 150.796 9.91433e-25 -8.61675e-15 9.91403e-25 150.796)
(150.796 -5.7192e-20 -7.25858e-15 -5.7192e-20 150.796 4.92549e-24 -7.25811e-15 4.9254e-24 150.796)
(150.796 -6.22107e-20 -6.63281e-15 -6.22107e-20 150.796 4.84988e-24 -6.63265e-15 4.84987e-24 150.796)
(150.796 -5.03142e-20 -4.08347e-15 -5.03142e-20 150.796 -9.91016e-24 -4.08326e-15 -9.91006e-24 150.796)
(150.796 -6.59428e-20 -5.92951e-15 -6.59428e-20 150.796 -5.25778e-25 -5.93017e-15 -5.25712e-25 150.796)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (150.796 -6.19928e-20 -8.89754e-15 -6.19928e-20 150.796 3.20195e-24 -8.89788e-15 3.20193e-24 150.796);
    }
    right
    {
        type            calculated;
        value           uniform (150.796 1.34577e-20 1.03822e-14 1.34577e-20 150.796 1.15136e-24 1.03815e-14 1.15129e-24 150.796);
    }
    beam
    {
        type            empty;
        value           nonuniform List<tensor> 0();
    }
}


// ************************************************************************* //
